Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_1136.txt
Running 20m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 123.913ms, rate sampling interval: 351ms
  Thread calibration: mean lat.: 97.621ms, rate sampling interval: 1052ms
  Thread calibration: mean lat.: 56.135ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 84.603ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 175.345ms, rate sampling interval: 590ms
  Thread calibration: mean lat.: 36.842ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 249.729ms, rate sampling interval: 1392ms
  Thread calibration: mean lat.: 356.561ms, rate sampling interval: 2404ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   246.97ms  225.98ms   1.01s    58.67%
    Req/Sec     5.98     12.99    60.00     83.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  234.11ms
 75.000%  398.08ms
 90.000%  508.16ms
 99.000%    1.01s 
 99.900%    1.54s 
 99.990%    2.07s 
 99.999%    2.39s 
100.000%    2.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.331     0.000000            1         1.00
      10.287     0.100000         5704         1.11
      12.815     0.200000        11392         1.25
     148.863     0.300000        17109         1.43
     150.399     0.400000        22853         1.67
     234.111     0.500000        28594         2.00
     235.263     0.550000        31654         2.22
     236.031     0.600000        34498         2.50
     237.055     0.650000        37218         2.86
     264.703     0.700000        39824         3.33
     398.079     0.750000        42793         4.00
     399.103     0.775000        44377         4.44
     400.127     0.800000        45557         5.00
     446.975     0.825000        46935         5.71
     506.111     0.850000        48357         6.67
     507.135     0.875000        49926         8.00
     507.647     0.887500        50709         8.89
     508.159     0.900000        51302        10.00
     509.183     0.912500        51920        11.43
     537.599     0.925000        52623        13.33
     601.599     0.937500        53349        16.00
     633.343     0.943750        53695        17.78
     661.503     0.950000        54049        20.00
     687.615     0.956250        54405        22.86
     720.895     0.962500        54757        26.67
     765.951     0.968750        55115        32.00
     791.551     0.971875        55291        35.56
     825.343     0.975000        55468        40.00
     860.671     0.978125        55648        45.71
     899.071     0.981250        55827        53.33
     938.495     0.984375        56001        64.00
     961.023     0.985938        56090        71.11
     980.479     0.987500        56178        80.00
     999.935     0.989062        56267        91.43
    1023.999     0.990625        56356       106.67
    1067.007     0.992188        56447       128.00
    1090.559     0.992969        56489       142.22
    1121.279     0.993750        56535       160.00
    1150.975     0.994531        56578       182.86
    1195.007     0.995313        56623       213.33
    1233.919     0.996094        56668       256.00
    1265.663     0.996484        56689       284.44
    1291.263     0.996875        56712       320.00
    1311.743     0.997266        56734       365.71
    1336.319     0.997656        56756       426.67
    1376.255     0.998047        56779       512.00
    1407.999     0.998242        56789       568.89
    1437.695     0.998437        56801       640.00
    1474.559     0.998633        56812       731.43
    1500.159     0.998828        56823       853.33
    1548.287     0.999023        56835      1024.00
    1568.767     0.999121        56839      1137.78
    1593.343     0.999219        56845      1280.00
    1632.255     0.999316        56851      1462.86
    1658.879     0.999414        56856      1706.67
    1685.503     0.999512        56862      2048.00
    1698.815     0.999561        56864      2275.56
    1720.319     0.999609        56867      2560.00
    1745.919     0.999658        56870      2925.71
    1796.095     0.999707        56873      3413.33
    1817.599     0.999756        56876      4096.00
    1860.607     0.999780        56877      4551.11
    1900.543     0.999805        56878      5120.00
    1924.095     0.999829        56880      5851.43
    1998.847     0.999854        56881      6826.67
    2069.503     0.999878        56883      8192.00
    2069.503     0.999890        56883      9102.22
    2121.727     0.999902        56884     10240.00
    2156.543     0.999915        56885     11702.86
    2156.543     0.999927        56885     13653.33
    2158.591     0.999939        56886     16384.00
    2158.591     0.999945        56886     18204.44
    2316.287     0.999951        56887     20480.00
    2316.287     0.999957        56887     23405.71
    2316.287     0.999963        56887     27306.67
    2390.015     0.999969        56888     32768.00
    2390.015     0.999973        56888     36408.89
    2390.015     0.999976        56888     40960.00
    2390.015     0.999979        56888     46811.43
    2390.015     0.999982        56888     54613.33
    2416.639     0.999985        56889     65536.00
    2416.639     1.000000        56889          inf
#[Mean    =      246.972, StdDeviation   =      225.977]
#[Max     =     2414.592, Total count    =        56889]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57416 requests in 20.00m, 16.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 21214
  Non-2xx or 3xx responses: 20
Requests/sec:     47.84  
Transfer/sec:     14.05KB