Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_10_0026.txt
Running 20m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 79.793ms, rate sampling interval: 498ms
  Thread calibration: mean lat.: 106.657ms, rate sampling interval: 1519ms
  Thread calibration: mean lat.: 67.786ms, rate sampling interval: 118ms
  Thread calibration: mean lat.: 59.974ms, rate sampling interval: 103ms
  Thread calibration: mean lat.: 58.323ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 75.827ms, rate sampling interval: 148ms
  Thread calibration: mean lat.: 72.357ms, rate sampling interval: 177ms
  Thread calibration: mean lat.: 128.429ms, rate sampling interval: 110ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   224.40ms  183.93ms 798.21ms   66.73%
    Req/Sec     5.76      8.13    40.00     84.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  231.42ms
 75.000%  398.08ms
 90.000%  401.92ms
 99.000%  798.21ms
 99.900%    1.16s 
 99.990%    1.46s 
 99.999%    1.70s 
100.000%    1.77s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.443     0.000000            1         1.00
      10.351     0.100000         5711         1.11
      12.751     0.200000        11386         1.25
     149.631     0.300000        17400         1.43
     151.295     0.400000        22966         1.67
     231.423     0.500000        28513         2.00
     232.703     0.550000        31619         2.22
     233.471     0.600000        34425         2.50
     234.495     0.650000        37147         2.86
     256.127     0.700000        39828         3.33
     398.079     0.750000        42701         4.00
     398.847     0.775000        44515         4.44
     399.359     0.800000        46154         5.00
     399.615     0.825000        47003         5.71
     400.127     0.850000        48555         6.67
     400.895     0.875000        50163         8.00
     401.151     0.887500        50543         8.89
     401.919     0.900000        51307        10.00
     405.503     0.912500        51923        11.43
     441.087     0.925000        52625        13.33
     481.535     0.937500        53336        16.00
     511.743     0.943750        53690        17.78
     540.159     0.950000        54057        20.00
     565.247     0.956250        54403        22.86
     602.111     0.962500        54761        26.67
     638.463     0.968750        55113        32.00
     657.919     0.971875        55293        35.56
     679.935     0.975000        55468        40.00
     702.975     0.978125        55649        45.71
     728.063     0.981250        55827        53.33
     751.615     0.984375        56004        64.00
     763.903     0.985938        56090        71.11
     776.191     0.987500        56182        80.00
     791.039     0.989062        56273        91.43
     810.495     0.990625        56357       106.67
     844.799     0.992188        56450       128.00
     863.743     0.992969        56490       142.22
     888.319     0.993750        56535       160.00
     906.751     0.994531        56579       182.86
     943.103     0.995313        56624       213.33
     973.311     0.996094        56668       256.00
     990.719     0.996484        56690       284.44
    1008.127     0.996875        56713       320.00
    1026.559     0.997266        56735       365.71
    1050.623     0.997656        56758       426.67
    1064.959     0.998047        56779       512.00
    1085.439     0.998242        56790       568.89
    1098.751     0.998437        56802       640.00
    1116.159     0.998633        56813       731.43
    1138.687     0.998828        56824       853.33
    1161.215     0.999023        56835      1024.00
    1168.383     0.999121        56841      1137.78
    1177.599     0.999219        56846      1280.00
    1204.223     0.999316        56852      1462.86
    1231.871     0.999414        56857      1706.67
    1266.687     0.999512        56863      2048.00
    1274.879     0.999561        56865      2275.56
    1311.743     0.999609        56868      2560.00
    1321.983     0.999658        56871      2925.71
    1340.415     0.999707        56874      3413.33
    1374.207     0.999756        56877      4096.00
    1382.399     0.999780        56878      4551.11
    1410.047     0.999805        56879      5120.00
    1426.431     0.999829        56881      5851.43
    1443.839     0.999854        56882      6826.67
    1456.127     0.999878        56884      8192.00
    1456.127     0.999890        56884      9102.22
    1499.135     0.999902        56885     10240.00
    1588.223     0.999915        56886     11702.86
    1588.223     0.999927        56886     13653.33
    1623.039     0.999939        56887     16384.00
    1623.039     0.999945        56887     18204.44
    1649.663     0.999951        56888     20480.00
    1649.663     0.999957        56888     23405.71
    1649.663     0.999963        56888     27306.67
    1701.887     0.999969        56889     32768.00
    1701.887     0.999973        56889     36408.89
    1701.887     0.999976        56889     40960.00
    1701.887     0.999979        56889     46811.43
    1701.887     0.999982        56889     54613.33
    1770.495     0.999985        56890     65536.00
    1770.495     1.000000        56890          inf
#[Mean    =      224.400, StdDeviation   =      183.932]
#[Max     =     1769.472, Total count    =        56890]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57415 requests in 20.00m, 16.40MB read
  Socket errors: connect 0, read 0, write 0, timeout 21222
Requests/sec:     47.84  
Transfer/sec:     14.00KB